zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_VIRT_WRAP.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_VIRT_WRAP
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_VIRT_WRAP_H_)  /* Check if memory map has not been already included */
#define S32K566_VIRT_WRAP_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- VIRT_WRAP Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VIRT_WRAP_Peripheral_Access_Layer VIRT_WRAP Peripheral Access Layer
 * @{
 */

/** VIRT_WRAP - Size of Registers Arrays */
#define VIRT_WRAP_REG_C_COUNT                     1u
#define VIRT_WRAP_REG_D_COUNT                     1u

/** VIRT_WRAP - Register Layout Typedef */
typedef struct VIRT_WRAP_Struct {
  __IO uint32_t REG_A3_0;                          /**< Parameter_n Register, offset: 0x0, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A7_4;                          /**< Parameter_n Register, offset: 0x4, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A11_8;                         /**< Parameter_n Register, offset: 0x8, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A15_12;                        /**< Parameter_n Register, offset: 0xC, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A19_16;                        /**< Parameter_n Register, offset: 0x10, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A23_20;                        /**< Parameter_n Register, offset: 0x14, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A27_24;                        /**< Parameter_n Register, offset: 0x18, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A31_28;                        /**< Parameter_n Register, offset: 0x1C, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A35_32;                        /**< Parameter_n Register, offset: 0x20, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A39_36;                        /**< Parameter_n Register, offset: 0x24, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A43_40;                        /**< Parameter_n Register, offset: 0x28, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A47_44;                        /**< Parameter_n Register, offset: 0x2C, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A51_48;                        /**< Parameter_n Register, offset: 0x30, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A55_52;                        /**< Parameter_n Register, offset: 0x34, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A59_56;                        /**< Parameter_n Register, offset: 0x38, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A63_60;                        /**< Parameter_n Register, offset: 0x3C, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A67_64;                        /**< Parameter_n Register, offset: 0x40, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A71_68;                        /**< Parameter_n Register, offset: 0x44, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A75_72;                        /**< Parameter_n Register, offset: 0x48, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A79_76;                        /**< Parameter_n Register, offset: 0x4C, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A83_80;                        /**< Parameter_n Register, offset: 0x50, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A87_84;                        /**< Parameter_n Register, offset: 0x54, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A91_88;                        /**< Parameter_n Register, offset: 0x58, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A95_92;                        /**< Parameter_n Register, offset: 0x5C, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A99_96;                        /**< Parameter_n Register, offset: 0x60, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A103_100;                      /**< Parameter_n Register, offset: 0x64, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A107_104;                      /**< Parameter_n Register, offset: 0x68, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A111_108;                      /**< Parameter_n Register, offset: 0x6C, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A115_112;                      /**< Parameter_n Register, offset: 0x70, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A119_116;                      /**< Parameter_n Register, offset: 0x74, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  uint8_t RESERVED_0[4];
  __IO uint32_t REG_A127_124;                      /**< Parameter_n Register, offset: 0x7C, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A131_128;                      /**< Parameter_n Register, offset: 0x80, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A135_132;                      /**< Parameter_n Register, offset: 0x84, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A139_136;                      /**< Parameter_n Register, offset: 0x88, available only on: VWRAP_1 (missing on LPE_VWRAP, VWRAP_0, VWRAP_3, VWRAP_4) */
  uint8_t RESERVED_1[20];
  __IO uint32_t REG_A163_160;                      /**< Parameter_n Register, offset: 0xA0, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A167_164;                      /**< Parameter_n Register, offset: 0xA4, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A171_168;                      /**< Parameter_n Register, offset: 0xA8, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A175_172;                      /**< Parameter_n Register, offset: 0xAC, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A179_176;                      /**< Parameter_n Register, offset: 0xB0, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A183_180;                      /**< Parameter_n Register, offset: 0xB4, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A187_184;                      /**< Parameter_n Register, offset: 0xB8, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A191_188;                      /**< Parameter_n Register, offset: 0xBC, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A195_192;                      /**< Parameter_n Register, offset: 0xC0, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A199_196;                      /**< Parameter_n Register, offset: 0xC4, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A203_200;                      /**< Parameter_n Register, offset: 0xC8, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A207_204;                      /**< Parameter_n Register, offset: 0xCC, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_A211_208;                      /**< Parameter_n Register, offset: 0xD0, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A215_212;                      /**< Parameter_n Register, offset: 0xD4, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A219_216;                      /**< Parameter_n Register, offset: 0xD8, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A223_220;                      /**< Parameter_n Register, offset: 0xDC, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A227_224;                      /**< Parameter_n Register, offset: 0xE0, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A231_228;                      /**< Parameter_n Register, offset: 0xE4, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A235_232;                      /**< Parameter_n Register, offset: 0xE8, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A239_236;                      /**< Parameter_n Register, offset: 0xEC, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A243_240;                      /**< Parameter_n Register, offset: 0xF0, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A247_244;                      /**< Parameter_n Register, offset: 0xF4, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A251_248;                      /**< Parameter_n Register, offset: 0xF8, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A255_252;                      /**< Parameter_n Register, offset: 0xFC, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A259_256;                      /**< Parameter_n Register, offset: 0x100, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_A263_260;                      /**< Parameter_n Register, offset: 0x104, available only on: VWRAP_3 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_4) */
  uint8_t RESERVED_2[40];
  __IO uint32_t REG_A307_304;                      /**< Parameter_n Register, offset: 0x130, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A311_308;                      /**< Parameter_n Register, offset: 0x134, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A315_312;                      /**< Parameter_n Register, offset: 0x138, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A319_316;                      /**< Parameter_n Register, offset: 0x13C, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A323_320;                      /**< Parameter_n Register, offset: 0x140, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A327_324;                      /**< Parameter_n Register, offset: 0x144, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A331_328;                      /**< Parameter_n Register, offset: 0x148, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A335_332;                      /**< Parameter_n Register, offset: 0x14C, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A339_336;                      /**< Parameter_n Register, offset: 0x150, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A343_340;                      /**< Parameter_n Register, offset: 0x154, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A347_344;                      /**< Parameter_n Register, offset: 0x158, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A351_348;                      /**< Parameter_n Register, offset: 0x15C, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A355_352;                      /**< Parameter_n Register, offset: 0x160, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A359_356;                      /**< Parameter_n Register, offset: 0x164, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_A363_360;                      /**< Parameter_n Register, offset: 0x168, available only on: VWRAP_4 (missing on LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3) */
  uint8_t RESERVED_3[660];
  __IO uint32_t REG_B3_0;                          /**< Parameter_n Register, offset: 0x400 */
  __IO uint32_t REG_B7_4;                          /**< Parameter_n Register, offset: 0x404 */
  __IO uint32_t REG_B11_8;                         /**< Parameter_n Register, offset: 0x408 */
  __IO uint32_t REG_B15_12;                        /**< Parameter_n Register, offset: 0x40C */
  __IO uint32_t REG_B19_16;                        /**< Parameter_n Register, offset: 0x410, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_B23_20;                        /**< Parameter_n Register, offset: 0x414, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_B27_24;                        /**< Parameter_n Register, offset: 0x418, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_B31_28;                        /**< Parameter_n Register, offset: 0x41C, available only on: LPE_VWRAP (missing on VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_B35_32;                        /**< Parameter_n Register, offset: 0x420 */
  __IO uint32_t REG_B39_36;                        /**< Parameter_n Register, offset: 0x424 */
  __IO uint32_t REG_B43_40;                        /**< Parameter_n Register, offset: 0x428 */
  __IO uint32_t REG_B47_44;                        /**< Parameter_n Register, offset: 0x42C */
  __IO uint32_t REG_B51_48;                        /**< Parameter_n Register, offset: 0x430, available only on: LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3 (missing on VWRAP_4) */
  __IO uint32_t REG_B55_52;                        /**< Parameter_n Register, offset: 0x434, available only on: LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3 (missing on VWRAP_4) */
  __IO uint32_t REG_B59_56;                        /**< Parameter_n Register, offset: 0x438, available only on: LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3 (missing on VWRAP_4) */
  __IO uint32_t REG_B63_60;                        /**< Parameter_n Register, offset: 0x43C, available only on: LPE_VWRAP, VWRAP_0, VWRAP_1, VWRAP_3 (missing on VWRAP_4) */
  __IO uint32_t REG_B67_64;                        /**< Parameter_n Register, offset: 0x440, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B71_68;                        /**< Parameter_n Register, offset: 0x444, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B75_72;                        /**< Parameter_n Register, offset: 0x448 */
  __IO uint32_t REG_B79_76;                        /**< Parameter_n Register, offset: 0x44C */
  __IO uint32_t REG_B83_80;                        /**< Parameter_n Register, offset: 0x450 */
  __IO uint32_t REG_B87_84;                        /**< Parameter_n Register, offset: 0x454, available only on: LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4 (missing on VWRAP_0) */
  __IO uint32_t REG_B91_88;                        /**< Parameter_n Register, offset: 0x458, available only on: VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP, VWRAP_0) */
  __IO uint32_t REG_B95_92;                        /**< Parameter_n Register, offset: 0x45C, available only on: LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4 (missing on VWRAP_0) */
  __IO uint32_t REG_B99_96;                        /**< Parameter_n Register, offset: 0x460 */
  __IO uint32_t REG_B103_100;                      /**< Parameter_n Register, offset: 0x464 */
  __IO uint32_t REG_B107_104;                      /**< Parameter_n Register, offset: 0x468, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B111_108;                      /**< Parameter_n Register, offset: 0x46C */
  __IO uint32_t REG_B115_112;                      /**< Parameter_n Register, offset: 0x470, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B119_116;                      /**< Parameter_n Register, offset: 0x474, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B123_120;                      /**< Parameter_n Register, offset: 0x478, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B127_124;                      /**< Parameter_n Register, offset: 0x47C, available only on: VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP, VWRAP_0) */
  __IO uint32_t REG_B131_128;                      /**< Parameter_n Register, offset: 0x480, available only on: VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP, VWRAP_0) */
  __IO uint32_t REG_B135_132;                      /**< Parameter_n Register, offset: 0x484, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B139_136;                      /**< Parameter_n Register, offset: 0x488, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B143_140;                      /**< Parameter_n Register, offset: 0x48C, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B147_144;                      /**< Parameter_n Register, offset: 0x490, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B151_148;                      /**< Parameter_n Register, offset: 0x494, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B155_152;                      /**< Parameter_n Register, offset: 0x498, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B159_156;                      /**< Parameter_n Register, offset: 0x49C, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B163_160;                      /**< Parameter_n Register, offset: 0x4A0, available only on: VWRAP_0, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP, VWRAP_1) */
  __IO uint32_t REG_B167_164;                      /**< Parameter_n Register, offset: 0x4A4, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B171_168;                      /**< Parameter_n Register, offset: 0x4A8, available only on: VWRAP_0, VWRAP_1, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP) */
  __IO uint32_t REG_B175_172;                      /**< Parameter_n Register, offset: 0x4AC, available only on: VWRAP_0, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP, VWRAP_1) */
  __IO uint32_t REG_B179_176;                      /**< Parameter_n Register, offset: 0x4B0, available only on: VWRAP_0, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP, VWRAP_1) */
  __IO uint32_t REG_B183_180;                      /**< Parameter_n Register, offset: 0x4B4, available only on: VWRAP_0, VWRAP_4 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3) */
  __IO uint32_t REG_B187_184;                      /**< Parameter_n Register, offset: 0x4B8, available only on: VWRAP_0, VWRAP_3, VWRAP_4 (missing on LPE_VWRAP, VWRAP_1) */
  __IO uint32_t REG_B191_188;                      /**< Parameter_n Register, offset: 0x4BC, available only on: VWRAP_0, VWRAP_3 (missing on LPE_VWRAP, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_B195_192;                      /**< Parameter_n Register, offset: 0x4C0, available only on: VWRAP_0, VWRAP_3 (missing on LPE_VWRAP, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_B199_196;                      /**< Parameter_n Register, offset: 0x4C4, available only on: VWRAP_0, VWRAP_3 (missing on LPE_VWRAP, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_B203_200;                      /**< Parameter_n Register, offset: 0x4C8, available only on: VWRAP_0, VWRAP_1, VWRAP_3 (missing on LPE_VWRAP, VWRAP_4) */
  __IO uint32_t REG_B207_204;                      /**< Parameter_n Register, offset: 0x4CC, available only on: VWRAP_0, VWRAP_3 (missing on LPE_VWRAP, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_B211_208;                      /**< Parameter_n Register, offset: 0x4D0, available only on: VWRAP_0, VWRAP_3 (missing on LPE_VWRAP, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_B215_212;                      /**< Parameter_n Register, offset: 0x4D4, available only on: VWRAP_0, VWRAP_3 (missing on LPE_VWRAP, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_B219_216;                      /**< Parameter_n Register, offset: 0x4D8, available only on: VWRAP_0, VWRAP_3 (missing on LPE_VWRAP, VWRAP_1, VWRAP_4) */
