zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
  __IO uint32_t REG_B223_220;                      /**< Parameter_n Register, offset: 0x4DC, available only on: VWRAP_0, VWRAP_3 (missing on LPE_VWRAP, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_B227_224;                      /**< Parameter_n Register, offset: 0x4E0, available only on: VWRAP_0, VWRAP_3 (missing on LPE_VWRAP, VWRAP_1, VWRAP_4) */
  __IO uint32_t REG_B231_228;                      /**< Parameter_n Register, offset: 0x4E4, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_B235_232;                      /**< Parameter_n Register, offset: 0x4E8, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_B239_236;                      /**< Parameter_n Register, offset: 0x4EC, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_B243_240;                      /**< Parameter_n Register, offset: 0x4F0, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_B247_244;                      /**< Parameter_n Register, offset: 0x4F4, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_B251_248;                      /**< Parameter_n Register, offset: 0x4F8, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  __IO uint32_t REG_B255_252;                      /**< Parameter_n Register, offset: 0x4FC, available only on: VWRAP_0 (missing on LPE_VWRAP, VWRAP_1, VWRAP_3, VWRAP_4) */
  uint8_t RESERVED_4[768];
  __IO uint32_t REG_C[VIRT_WRAP_REG_C_COUNT];      /**< Parameter_n Register, array offset: 0x800, array step: 0x4 */
  uint8_t RESERVED_5[1020];
  __IO uint32_t REG_D[VIRT_WRAP_REG_D_COUNT];      /**< Parameter_n Register, array offset: 0xC00, array step: 0x4 */
} VIRT_WRAP_Type, *VIRT_WRAP_MemMapPtr;

/** Number of instances of the VIRT_WRAP module. */
#define VIRT_WRAP_INSTANCE_COUNT                 (5u)

/* VIRT_WRAP - Peripheral instance base addresses */
/** Peripheral LPE_VWRAP base address */
#define IP_LPE_VWRAP_BASE                        (0x42088000u)
/** Peripheral LPE_VWRAP base pointer */
#define IP_LPE_VWRAP                             ((VIRT_WRAP_Type *)IP_LPE_VWRAP_BASE)
/** Peripheral VWRAP_0 base address */
#define IP_VWRAP_0_BASE                          (0x40010000u)
/** Peripheral VWRAP_0 base pointer */
#define IP_VWRAP_0                               ((VIRT_WRAP_Type *)IP_VWRAP_0_BASE)
/** Peripheral VWRAP_1 base address */
#define IP_VWRAP_1_BASE                          (0x40200000u)
/** Peripheral VWRAP_1 base pointer */
#define IP_VWRAP_1                               ((VIRT_WRAP_Type *)IP_VWRAP_1_BASE)
/** Peripheral VWRAP_3 base address */
#define IP_VWRAP_3_BASE                          (0x4060C000u)
/** Peripheral VWRAP_3 base pointer */
#define IP_VWRAP_3                               ((VIRT_WRAP_Type *)IP_VWRAP_3_BASE)
/** Peripheral VWRAP_4 base address */
#define IP_VWRAP_4_BASE                          (0x40800000u)
/** Peripheral VWRAP_4 base pointer */
#define IP_VWRAP_4                               ((VIRT_WRAP_Type *)IP_VWRAP_4_BASE)
/** Array initializer of VIRT_WRAP peripheral base addresses */
#define IP_VIRT_WRAP_BASE_ADDRS                  { IP_LPE_VWRAP_BASE, IP_VWRAP_0_BASE, IP_VWRAP_1_BASE, IP_VWRAP_3_BASE, IP_VWRAP_4_BASE }
/** Array initializer of VIRT_WRAP peripheral base pointers */
#define IP_VIRT_WRAP_BASE_PTRS                   { IP_LPE_VWRAP, IP_VWRAP_0, IP_VWRAP_1, IP_VWRAP_3, IP_VWRAP_4 }

/* ----------------------------------------------------------------------------
   -- VIRT_WRAP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VIRT_WRAP_Register_Masks VIRT_WRAP Register Masks
 * @{
 */

/*! @name REG_A3_0 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A3_0_PAD_0_MASK            (0xFU)
#define VIRT_WRAP_REG_A3_0_PAD_0_SHIFT           (0U)
#define VIRT_WRAP_REG_A3_0_PAD_0_WIDTH           (4U)
#define VIRT_WRAP_REG_A3_0_PAD_0(x)              (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A3_0_PAD_0_SHIFT)) & VIRT_WRAP_REG_A3_0_PAD_0_MASK)

#define VIRT_WRAP_REG_A3_0_PAD_1_MASK            (0xF00U)
#define VIRT_WRAP_REG_A3_0_PAD_1_SHIFT           (8U)
#define VIRT_WRAP_REG_A3_0_PAD_1_WIDTH           (4U)
#define VIRT_WRAP_REG_A3_0_PAD_1(x)              (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A3_0_PAD_1_SHIFT)) & VIRT_WRAP_REG_A3_0_PAD_1_MASK)

#define VIRT_WRAP_REG_A3_0_PAD_2_MASK            (0xF0000U)
#define VIRT_WRAP_REG_A3_0_PAD_2_SHIFT           (16U)
#define VIRT_WRAP_REG_A3_0_PAD_2_WIDTH           (4U)
#define VIRT_WRAP_REG_A3_0_PAD_2(x)              (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A3_0_PAD_2_SHIFT)) & VIRT_WRAP_REG_A3_0_PAD_2_MASK)

#define VIRT_WRAP_REG_A3_0_PAD_3_MASK            (0xF000000U)
#define VIRT_WRAP_REG_A3_0_PAD_3_SHIFT           (24U)
#define VIRT_WRAP_REG_A3_0_PAD_3_WIDTH           (4U)
#define VIRT_WRAP_REG_A3_0_PAD_3(x)              (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A3_0_PAD_3_SHIFT)) & VIRT_WRAP_REG_A3_0_PAD_3_MASK)
/*! @} */

/*! @name REG_A7_4 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A7_4_PAD_0_MASK            (0xFU)
#define VIRT_WRAP_REG_A7_4_PAD_0_SHIFT           (0U)
#define VIRT_WRAP_REG_A7_4_PAD_0_WIDTH           (4U)
#define VIRT_WRAP_REG_A7_4_PAD_0(x)              (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A7_4_PAD_0_SHIFT)) & VIRT_WRAP_REG_A7_4_PAD_0_MASK)

#define VIRT_WRAP_REG_A7_4_PAD_1_MASK            (0xF00U)
#define VIRT_WRAP_REG_A7_4_PAD_1_SHIFT           (8U)
#define VIRT_WRAP_REG_A7_4_PAD_1_WIDTH           (4U)
#define VIRT_WRAP_REG_A7_4_PAD_1(x)              (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A7_4_PAD_1_SHIFT)) & VIRT_WRAP_REG_A7_4_PAD_1_MASK)

#define VIRT_WRAP_REG_A7_4_PAD_2_MASK            (0xF0000U)
#define VIRT_WRAP_REG_A7_4_PAD_2_SHIFT           (16U)
#define VIRT_WRAP_REG_A7_4_PAD_2_WIDTH           (4U)
#define VIRT_WRAP_REG_A7_4_PAD_2(x)              (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A7_4_PAD_2_SHIFT)) & VIRT_WRAP_REG_A7_4_PAD_2_MASK)

#define VIRT_WRAP_REG_A7_4_PAD_3_MASK            (0xF000000U)
#define VIRT_WRAP_REG_A7_4_PAD_3_SHIFT           (24U)
#define VIRT_WRAP_REG_A7_4_PAD_3_WIDTH           (4U)
#define VIRT_WRAP_REG_A7_4_PAD_3(x)              (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A7_4_PAD_3_SHIFT)) & VIRT_WRAP_REG_A7_4_PAD_3_MASK)
/*! @} */

/*! @name REG_A11_8 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A11_8_PAD_0_MASK           (0xFU)
#define VIRT_WRAP_REG_A11_8_PAD_0_SHIFT          (0U)
#define VIRT_WRAP_REG_A11_8_PAD_0_WIDTH          (4U)
#define VIRT_WRAP_REG_A11_8_PAD_0(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A11_8_PAD_0_SHIFT)) & VIRT_WRAP_REG_A11_8_PAD_0_MASK)

#define VIRT_WRAP_REG_A11_8_PAD_1_MASK           (0xF00U)
#define VIRT_WRAP_REG_A11_8_PAD_1_SHIFT          (8U)
#define VIRT_WRAP_REG_A11_8_PAD_1_WIDTH          (4U)
#define VIRT_WRAP_REG_A11_8_PAD_1(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A11_8_PAD_1_SHIFT)) & VIRT_WRAP_REG_A11_8_PAD_1_MASK)

#define VIRT_WRAP_REG_A11_8_PAD_2_MASK           (0xF0000U)
#define VIRT_WRAP_REG_A11_8_PAD_2_SHIFT          (16U)
#define VIRT_WRAP_REG_A11_8_PAD_2_WIDTH          (4U)
#define VIRT_WRAP_REG_A11_8_PAD_2(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A11_8_PAD_2_SHIFT)) & VIRT_WRAP_REG_A11_8_PAD_2_MASK)

#define VIRT_WRAP_REG_A11_8_PAD_3_MASK           (0xF000000U)
#define VIRT_WRAP_REG_A11_8_PAD_3_SHIFT          (24U)
#define VIRT_WRAP_REG_A11_8_PAD_3_WIDTH          (4U)
#define VIRT_WRAP_REG_A11_8_PAD_3(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A11_8_PAD_3_SHIFT)) & VIRT_WRAP_REG_A11_8_PAD_3_MASK)
/*! @} */

/*! @name REG_A15_12 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A15_12_PAD_0_MASK          (0xFU)
#define VIRT_WRAP_REG_A15_12_PAD_0_SHIFT         (0U)
#define VIRT_WRAP_REG_A15_12_PAD_0_WIDTH         (4U)
#define VIRT_WRAP_REG_A15_12_PAD_0(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A15_12_PAD_0_SHIFT)) & VIRT_WRAP_REG_A15_12_PAD_0_MASK)

#define VIRT_WRAP_REG_A15_12_PAD_1_MASK          (0xF00U)
#define VIRT_WRAP_REG_A15_12_PAD_1_SHIFT         (8U)
#define VIRT_WRAP_REG_A15_12_PAD_1_WIDTH         (4U)
#define VIRT_WRAP_REG_A15_12_PAD_1(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A15_12_PAD_1_SHIFT)) & VIRT_WRAP_REG_A15_12_PAD_1_MASK)

#define VIRT_WRAP_REG_A15_12_PAD_2_MASK          (0xF0000U)
#define VIRT_WRAP_REG_A15_12_PAD_2_SHIFT         (16U)
#define VIRT_WRAP_REG_A15_12_PAD_2_WIDTH         (4U)
#define VIRT_WRAP_REG_A15_12_PAD_2(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A15_12_PAD_2_SHIFT)) & VIRT_WRAP_REG_A15_12_PAD_2_MASK)

