zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_A59_56_PAD_2_MASK          (0xF0000U)
#define VIRT_WRAP_REG_A59_56_PAD_2_SHIFT         (16U)
#define VIRT_WRAP_REG_A59_56_PAD_2_WIDTH         (4U)
#define VIRT_WRAP_REG_A59_56_PAD_2(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A59_56_PAD_2_SHIFT)) & VIRT_WRAP_REG_A59_56_PAD_2_MASK)

#define VIRT_WRAP_REG_A59_56_PAD_3_MASK          (0xF000000U)
#define VIRT_WRAP_REG_A59_56_PAD_3_SHIFT         (24U)
#define VIRT_WRAP_REG_A59_56_PAD_3_WIDTH         (4U)
#define VIRT_WRAP_REG_A59_56_PAD_3(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A59_56_PAD_3_SHIFT)) & VIRT_WRAP_REG_A59_56_PAD_3_MASK)
/*! @} */

/*! @name REG_A63_60 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A63_60_PAD_0_MASK          (0xFU)
#define VIRT_WRAP_REG_A63_60_PAD_0_SHIFT         (0U)
#define VIRT_WRAP_REG_A63_60_PAD_0_WIDTH         (4U)
#define VIRT_WRAP_REG_A63_60_PAD_0(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A63_60_PAD_0_SHIFT)) & VIRT_WRAP_REG_A63_60_PAD_0_MASK)

#define VIRT_WRAP_REG_A63_60_PAD_1_MASK          (0xF00U)
#define VIRT_WRAP_REG_A63_60_PAD_1_SHIFT         (8U)
#define VIRT_WRAP_REG_A63_60_PAD_1_WIDTH         (4U)
#define VIRT_WRAP_REG_A63_60_PAD_1(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A63_60_PAD_1_SHIFT)) & VIRT_WRAP_REG_A63_60_PAD_1_MASK)

#define VIRT_WRAP_REG_A63_60_PAD_2_MASK          (0xF0000U)
#define VIRT_WRAP_REG_A63_60_PAD_2_SHIFT         (16U)
#define VIRT_WRAP_REG_A63_60_PAD_2_WIDTH         (4U)
#define VIRT_WRAP_REG_A63_60_PAD_2(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A63_60_PAD_2_SHIFT)) & VIRT_WRAP_REG_A63_60_PAD_2_MASK)

#define VIRT_WRAP_REG_A63_60_PAD_3_MASK          (0xF000000U)
#define VIRT_WRAP_REG_A63_60_PAD_3_SHIFT         (24U)
#define VIRT_WRAP_REG_A63_60_PAD_3_WIDTH         (4U)
#define VIRT_WRAP_REG_A63_60_PAD_3(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A63_60_PAD_3_SHIFT)) & VIRT_WRAP_REG_A63_60_PAD_3_MASK)
/*! @} */

/*! @name REG_A67_64 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A67_64_PAD_0_MASK          (0xFU)
#define VIRT_WRAP_REG_A67_64_PAD_0_SHIFT         (0U)
#define VIRT_WRAP_REG_A67_64_PAD_0_WIDTH         (4U)
#define VIRT_WRAP_REG_A67_64_PAD_0(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A67_64_PAD_0_SHIFT)) & VIRT_WRAP_REG_A67_64_PAD_0_MASK)

#define VIRT_WRAP_REG_A67_64_PAD_1_MASK          (0xF00U)
#define VIRT_WRAP_REG_A67_64_PAD_1_SHIFT         (8U)
#define VIRT_WRAP_REG_A67_64_PAD_1_WIDTH         (4U)
#define VIRT_WRAP_REG_A67_64_PAD_1(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A67_64_PAD_1_SHIFT)) & VIRT_WRAP_REG_A67_64_PAD_1_MASK)

#define VIRT_WRAP_REG_A67_64_PAD_2_MASK          (0xF0000U)
#define VIRT_WRAP_REG_A67_64_PAD_2_SHIFT         (16U)
#define VIRT_WRAP_REG_A67_64_PAD_2_WIDTH         (4U)
#define VIRT_WRAP_REG_A67_64_PAD_2(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A67_64_PAD_2_SHIFT)) & VIRT_WRAP_REG_A67_64_PAD_2_MASK)

#define VIRT_WRAP_REG_A67_64_PAD_3_MASK          (0xF000000U)
#define VIRT_WRAP_REG_A67_64_PAD_3_SHIFT         (24U)
#define VIRT_WRAP_REG_A67_64_PAD_3_WIDTH         (4U)
#define VIRT_WRAP_REG_A67_64_PAD_3(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A67_64_PAD_3_SHIFT)) & VIRT_WRAP_REG_A67_64_PAD_3_MASK)
/*! @} */

/*! @name REG_A71_68 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A71_68_PAD_0_MASK          (0xFU)
#define VIRT_WRAP_REG_A71_68_PAD_0_SHIFT         (0U)
#define VIRT_WRAP_REG_A71_68_PAD_0_WIDTH         (4U)
#define VIRT_WRAP_REG_A71_68_PAD_0(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A71_68_PAD_0_SHIFT)) & VIRT_WRAP_REG_A71_68_PAD_0_MASK)

#define VIRT_WRAP_REG_A71_68_PAD_1_MASK          (0xF00U)
#define VIRT_WRAP_REG_A71_68_PAD_1_SHIFT         (8U)
#define VIRT_WRAP_REG_A71_68_PAD_1_WIDTH         (4U)
#define VIRT_WRAP_REG_A71_68_PAD_1(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A71_68_PAD_1_SHIFT)) & VIRT_WRAP_REG_A71_68_PAD_1_MASK)

#define VIRT_WRAP_REG_A71_68_PAD_2_MASK          (0xF0000U)
#define VIRT_WRAP_REG_A71_68_PAD_2_SHIFT         (16U)
#define VIRT_WRAP_REG_A71_68_PAD_2_WIDTH         (4U)
#define VIRT_WRAP_REG_A71_68_PAD_2(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A71_68_PAD_2_SHIFT)) & VIRT_WRAP_REG_A71_68_PAD_2_MASK)

#define VIRT_WRAP_REG_A71_68_PAD_3_MASK          (0xF000000U)
#define VIRT_WRAP_REG_A71_68_PAD_3_SHIFT         (24U)
#define VIRT_WRAP_REG_A71_68_PAD_3_WIDTH         (4U)
#define VIRT_WRAP_REG_A71_68_PAD_3(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A71_68_PAD_3_SHIFT)) & VIRT_WRAP_REG_A71_68_PAD_3_MASK)
/*! @} */

/*! @name REG_A75_72 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A75_72_PAD_0_MASK          (0xFU)
#define VIRT_WRAP_REG_A75_72_PAD_0_SHIFT         (0U)
#define VIRT_WRAP_REG_A75_72_PAD_0_WIDTH         (4U)
#define VIRT_WRAP_REG_A75_72_PAD_0(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A75_72_PAD_0_SHIFT)) & VIRT_WRAP_REG_A75_72_PAD_0_MASK)

#define VIRT_WRAP_REG_A75_72_PAD_1_MASK          (0xF00U)
#define VIRT_WRAP_REG_A75_72_PAD_1_SHIFT         (8U)
#define VIRT_WRAP_REG_A75_72_PAD_1_WIDTH         (4U)
#define VIRT_WRAP_REG_A75_72_PAD_1(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A75_72_PAD_1_SHIFT)) & VIRT_WRAP_REG_A75_72_PAD_1_MASK)

#define VIRT_WRAP_REG_A75_72_PAD_2_MASK          (0xF0000U)
#define VIRT_WRAP_REG_A75_72_PAD_2_SHIFT         (16U)
#define VIRT_WRAP_REG_A75_72_PAD_2_WIDTH         (4U)
#define VIRT_WRAP_REG_A75_72_PAD_2(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A75_72_PAD_2_SHIFT)) & VIRT_WRAP_REG_A75_72_PAD_2_MASK)

#define VIRT_WRAP_REG_A75_72_PAD_3_MASK          (0xF000000U)
#define VIRT_WRAP_REG_A75_72_PAD_3_SHIFT         (24U)
#define VIRT_WRAP_REG_A75_72_PAD_3_WIDTH         (4U)
#define VIRT_WRAP_REG_A75_72_PAD_3(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A75_72_PAD_3_SHIFT)) & VIRT_WRAP_REG_A75_72_PAD_3_MASK)
/*! @} */

/*! @name REG_A79_76 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A79_76_PAD_0_MASK          (0xFU)
#define VIRT_WRAP_REG_A79_76_PAD_0_SHIFT         (0U)
#define VIRT_WRAP_REG_A79_76_PAD_0_WIDTH         (4U)
#define VIRT_WRAP_REG_A79_76_PAD_0(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A79_76_PAD_0_SHIFT)) & VIRT_WRAP_REG_A79_76_PAD_0_MASK)

