zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_A99_96_PAD_2_MASK          (0xF0000U)
#define VIRT_WRAP_REG_A99_96_PAD_2_SHIFT         (16U)
#define VIRT_WRAP_REG_A99_96_PAD_2_WIDTH         (4U)
#define VIRT_WRAP_REG_A99_96_PAD_2(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A99_96_PAD_2_SHIFT)) & VIRT_WRAP_REG_A99_96_PAD_2_MASK)

#define VIRT_WRAP_REG_A99_96_PAD_3_MASK          (0xF000000U)
#define VIRT_WRAP_REG_A99_96_PAD_3_SHIFT         (24U)
#define VIRT_WRAP_REG_A99_96_PAD_3_WIDTH         (4U)
#define VIRT_WRAP_REG_A99_96_PAD_3(x)            (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A99_96_PAD_3_SHIFT)) & VIRT_WRAP_REG_A99_96_PAD_3_MASK)
/*! @} */

/*! @name REG_A103_100 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A103_100_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A103_100_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A103_100_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A103_100_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A103_100_PAD_0_SHIFT)) & VIRT_WRAP_REG_A103_100_PAD_0_MASK)

#define VIRT_WRAP_REG_A103_100_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A103_100_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A103_100_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A103_100_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A103_100_PAD_1_SHIFT)) & VIRT_WRAP_REG_A103_100_PAD_1_MASK)

#define VIRT_WRAP_REG_A103_100_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A103_100_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A103_100_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A103_100_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A103_100_PAD_2_SHIFT)) & VIRT_WRAP_REG_A103_100_PAD_2_MASK)

#define VIRT_WRAP_REG_A103_100_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A103_100_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A103_100_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A103_100_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A103_100_PAD_3_SHIFT)) & VIRT_WRAP_REG_A103_100_PAD_3_MASK)
/*! @} */

/*! @name REG_A107_104 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A107_104_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A107_104_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A107_104_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A107_104_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A107_104_PAD_0_SHIFT)) & VIRT_WRAP_REG_A107_104_PAD_0_MASK)

#define VIRT_WRAP_REG_A107_104_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A107_104_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A107_104_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A107_104_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A107_104_PAD_1_SHIFT)) & VIRT_WRAP_REG_A107_104_PAD_1_MASK)

#define VIRT_WRAP_REG_A107_104_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A107_104_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A107_104_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A107_104_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A107_104_PAD_2_SHIFT)) & VIRT_WRAP_REG_A107_104_PAD_2_MASK)

#define VIRT_WRAP_REG_A107_104_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A107_104_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A107_104_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A107_104_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A107_104_PAD_3_SHIFT)) & VIRT_WRAP_REG_A107_104_PAD_3_MASK)
/*! @} */

/*! @name REG_A111_108 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A111_108_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A111_108_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A111_108_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A111_108_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A111_108_PAD_0_SHIFT)) & VIRT_WRAP_REG_A111_108_PAD_0_MASK)

#define VIRT_WRAP_REG_A111_108_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A111_108_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A111_108_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A111_108_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A111_108_PAD_1_SHIFT)) & VIRT_WRAP_REG_A111_108_PAD_1_MASK)

#define VIRT_WRAP_REG_A111_108_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A111_108_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A111_108_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A111_108_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A111_108_PAD_2_SHIFT)) & VIRT_WRAP_REG_A111_108_PAD_2_MASK)

#define VIRT_WRAP_REG_A111_108_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A111_108_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A111_108_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A111_108_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A111_108_PAD_3_SHIFT)) & VIRT_WRAP_REG_A111_108_PAD_3_MASK)
/*! @} */

/*! @name REG_A115_112 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A115_112_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A115_112_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A115_112_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A115_112_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A115_112_PAD_0_SHIFT)) & VIRT_WRAP_REG_A115_112_PAD_0_MASK)
/*! @} */

/*! @name REG_A119_116 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A119_116_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A119_116_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A119_116_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A119_116_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A119_116_PAD_0_SHIFT)) & VIRT_WRAP_REG_A119_116_PAD_0_MASK)
/*! @} */

/*! @name REG_A127_124 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A127_124_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A127_124_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A127_124_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A127_124_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A127_124_PAD_2_SHIFT)) & VIRT_WRAP_REG_A127_124_PAD_2_MASK)

#define VIRT_WRAP_REG_A127_124_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A127_124_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A127_124_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A127_124_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A127_124_PAD_3_SHIFT)) & VIRT_WRAP_REG_A127_124_PAD_3_MASK)
/*! @} */

/*! @name REG_A131_128 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A131_128_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A131_128_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A131_128_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A131_128_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A131_128_PAD_0_SHIFT)) & VIRT_WRAP_REG_A131_128_PAD_0_MASK)

