zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_A131_128_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A131_128_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A131_128_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A131_128_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A131_128_PAD_1_SHIFT)) & VIRT_WRAP_REG_A131_128_PAD_1_MASK)

#define VIRT_WRAP_REG_A131_128_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A131_128_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A131_128_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A131_128_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A131_128_PAD_2_SHIFT)) & VIRT_WRAP_REG_A131_128_PAD_2_MASK)

#define VIRT_WRAP_REG_A131_128_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A131_128_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A131_128_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A131_128_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A131_128_PAD_3_SHIFT)) & VIRT_WRAP_REG_A131_128_PAD_3_MASK)
/*! @} */

/*! @name REG_A135_132 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A135_132_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A135_132_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A135_132_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A135_132_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A135_132_PAD_0_SHIFT)) & VIRT_WRAP_REG_A135_132_PAD_0_MASK)

#define VIRT_WRAP_REG_A135_132_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A135_132_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A135_132_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A135_132_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A135_132_PAD_1_SHIFT)) & VIRT_WRAP_REG_A135_132_PAD_1_MASK)

#define VIRT_WRAP_REG_A135_132_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A135_132_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A135_132_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A135_132_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A135_132_PAD_2_SHIFT)) & VIRT_WRAP_REG_A135_132_PAD_2_MASK)

#define VIRT_WRAP_REG_A135_132_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A135_132_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A135_132_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A135_132_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A135_132_PAD_3_SHIFT)) & VIRT_WRAP_REG_A135_132_PAD_3_MASK)
/*! @} */

/*! @name REG_A139_136 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A139_136_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A139_136_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A139_136_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A139_136_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A139_136_PAD_0_SHIFT)) & VIRT_WRAP_REG_A139_136_PAD_0_MASK)

#define VIRT_WRAP_REG_A139_136_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A139_136_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A139_136_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A139_136_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A139_136_PAD_1_SHIFT)) & VIRT_WRAP_REG_A139_136_PAD_1_MASK)

#define VIRT_WRAP_REG_A139_136_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A139_136_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A139_136_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A139_136_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A139_136_PAD_2_SHIFT)) & VIRT_WRAP_REG_A139_136_PAD_2_MASK)
/*! @} */

/*! @name REG_A163_160 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A163_160_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A163_160_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A163_160_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A163_160_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A163_160_PAD_0_SHIFT)) & VIRT_WRAP_REG_A163_160_PAD_0_MASK)

#define VIRT_WRAP_REG_A163_160_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A163_160_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A163_160_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A163_160_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A163_160_PAD_1_SHIFT)) & VIRT_WRAP_REG_A163_160_PAD_1_MASK)

#define VIRT_WRAP_REG_A163_160_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A163_160_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A163_160_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A163_160_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A163_160_PAD_2_SHIFT)) & VIRT_WRAP_REG_A163_160_PAD_2_MASK)

#define VIRT_WRAP_REG_A163_160_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A163_160_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A163_160_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A163_160_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A163_160_PAD_3_SHIFT)) & VIRT_WRAP_REG_A163_160_PAD_3_MASK)
/*! @} */

/*! @name REG_A167_164 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A167_164_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A167_164_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A167_164_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A167_164_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A167_164_PAD_0_SHIFT)) & VIRT_WRAP_REG_A167_164_PAD_0_MASK)

#define VIRT_WRAP_REG_A167_164_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A167_164_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A167_164_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A167_164_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A167_164_PAD_1_SHIFT)) & VIRT_WRAP_REG_A167_164_PAD_1_MASK)

#define VIRT_WRAP_REG_A167_164_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A167_164_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A167_164_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A167_164_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A167_164_PAD_2_SHIFT)) & VIRT_WRAP_REG_A167_164_PAD_2_MASK)

#define VIRT_WRAP_REG_A167_164_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A167_164_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A167_164_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A167_164_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A167_164_PAD_3_SHIFT)) & VIRT_WRAP_REG_A167_164_PAD_3_MASK)
/*! @} */

