zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
/*! @name REG_A171_168 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A171_168_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A171_168_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A171_168_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A171_168_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A171_168_PAD_0_SHIFT)) & VIRT_WRAP_REG_A171_168_PAD_0_MASK)

#define VIRT_WRAP_REG_A171_168_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A171_168_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A171_168_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A171_168_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A171_168_PAD_1_SHIFT)) & VIRT_WRAP_REG_A171_168_PAD_1_MASK)

#define VIRT_WRAP_REG_A171_168_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A171_168_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A171_168_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A171_168_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A171_168_PAD_2_SHIFT)) & VIRT_WRAP_REG_A171_168_PAD_2_MASK)

#define VIRT_WRAP_REG_A171_168_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A171_168_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A171_168_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A171_168_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A171_168_PAD_3_SHIFT)) & VIRT_WRAP_REG_A171_168_PAD_3_MASK)
/*! @} */

/*! @name REG_A175_172 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A175_172_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A175_172_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A175_172_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A175_172_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A175_172_PAD_0_SHIFT)) & VIRT_WRAP_REG_A175_172_PAD_0_MASK)

#define VIRT_WRAP_REG_A175_172_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A175_172_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A175_172_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A175_172_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A175_172_PAD_1_SHIFT)) & VIRT_WRAP_REG_A175_172_PAD_1_MASK)

#define VIRT_WRAP_REG_A175_172_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A175_172_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A175_172_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A175_172_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A175_172_PAD_2_SHIFT)) & VIRT_WRAP_REG_A175_172_PAD_2_MASK)

#define VIRT_WRAP_REG_A175_172_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A175_172_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A175_172_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A175_172_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A175_172_PAD_3_SHIFT)) & VIRT_WRAP_REG_A175_172_PAD_3_MASK)
/*! @} */

/*! @name REG_A179_176 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A179_176_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A179_176_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A179_176_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A179_176_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A179_176_PAD_0_SHIFT)) & VIRT_WRAP_REG_A179_176_PAD_0_MASK)

#define VIRT_WRAP_REG_A179_176_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A179_176_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A179_176_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A179_176_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A179_176_PAD_1_SHIFT)) & VIRT_WRAP_REG_A179_176_PAD_1_MASK)

#define VIRT_WRAP_REG_A179_176_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A179_176_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A179_176_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A179_176_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A179_176_PAD_2_SHIFT)) & VIRT_WRAP_REG_A179_176_PAD_2_MASK)

#define VIRT_WRAP_REG_A179_176_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A179_176_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A179_176_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A179_176_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A179_176_PAD_3_SHIFT)) & VIRT_WRAP_REG_A179_176_PAD_3_MASK)
/*! @} */

/*! @name REG_A183_180 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A183_180_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A183_180_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A183_180_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A183_180_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A183_180_PAD_0_SHIFT)) & VIRT_WRAP_REG_A183_180_PAD_0_MASK)

#define VIRT_WRAP_REG_A183_180_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A183_180_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A183_180_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A183_180_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A183_180_PAD_1_SHIFT)) & VIRT_WRAP_REG_A183_180_PAD_1_MASK)

#define VIRT_WRAP_REG_A183_180_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A183_180_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A183_180_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A183_180_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A183_180_PAD_2_SHIFT)) & VIRT_WRAP_REG_A183_180_PAD_2_MASK)

#define VIRT_WRAP_REG_A183_180_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A183_180_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A183_180_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A183_180_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A183_180_PAD_3_SHIFT)) & VIRT_WRAP_REG_A183_180_PAD_3_MASK)
/*! @} */

/*! @name REG_A187_184 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A187_184_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A187_184_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A187_184_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A187_184_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A187_184_PAD_0_SHIFT)) & VIRT_WRAP_REG_A187_184_PAD_0_MASK)

#define VIRT_WRAP_REG_A187_184_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A187_184_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A187_184_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A187_184_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A187_184_PAD_1_SHIFT)) & VIRT_WRAP_REG_A187_184_PAD_1_MASK)

#define VIRT_WRAP_REG_A187_184_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A187_184_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A187_184_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A187_184_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A187_184_PAD_2_SHIFT)) & VIRT_WRAP_REG_A187_184_PAD_2_MASK)

#define VIRT_WRAP_REG_A187_184_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A187_184_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A187_184_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A187_184_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A187_184_PAD_3_SHIFT)) & VIRT_WRAP_REG_A187_184_PAD_3_MASK)
/*! @} */

/*! @name REG_A191_188 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A191_188_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A191_188_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A191_188_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A191_188_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A191_188_PAD_0_SHIFT)) & VIRT_WRAP_REG_A191_188_PAD_0_MASK)

#define VIRT_WRAP_REG_A191_188_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A191_188_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A191_188_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A191_188_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A191_188_PAD_1_SHIFT)) & VIRT_WRAP_REG_A191_188_PAD_1_MASK)

#define VIRT_WRAP_REG_A191_188_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A191_188_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A191_188_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A191_188_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A191_188_PAD_2_SHIFT)) & VIRT_WRAP_REG_A191_188_PAD_2_MASK)

#define VIRT_WRAP_REG_A191_188_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A191_188_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A191_188_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A191_188_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A191_188_PAD_3_SHIFT)) & VIRT_WRAP_REG_A191_188_PAD_3_MASK)
/*! @} */

