zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
/*! @name REG_A195_192 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A195_192_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A195_192_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A195_192_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A195_192_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A195_192_PAD_0_SHIFT)) & VIRT_WRAP_REG_A195_192_PAD_0_MASK)

#define VIRT_WRAP_REG_A195_192_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A195_192_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A195_192_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A195_192_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A195_192_PAD_1_SHIFT)) & VIRT_WRAP_REG_A195_192_PAD_1_MASK)

#define VIRT_WRAP_REG_A195_192_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A195_192_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A195_192_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A195_192_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A195_192_PAD_2_SHIFT)) & VIRT_WRAP_REG_A195_192_PAD_2_MASK)

#define VIRT_WRAP_REG_A195_192_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A195_192_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A195_192_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A195_192_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A195_192_PAD_3_SHIFT)) & VIRT_WRAP_REG_A195_192_PAD_3_MASK)
/*! @} */

/*! @name REG_A199_196 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A199_196_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A199_196_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A199_196_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A199_196_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A199_196_PAD_0_SHIFT)) & VIRT_WRAP_REG_A199_196_PAD_0_MASK)

#define VIRT_WRAP_REG_A199_196_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A199_196_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A199_196_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A199_196_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A199_196_PAD_1_SHIFT)) & VIRT_WRAP_REG_A199_196_PAD_1_MASK)

#define VIRT_WRAP_REG_A199_196_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A199_196_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A199_196_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A199_196_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A199_196_PAD_2_SHIFT)) & VIRT_WRAP_REG_A199_196_PAD_2_MASK)

#define VIRT_WRAP_REG_A199_196_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A199_196_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A199_196_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A199_196_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A199_196_PAD_3_SHIFT)) & VIRT_WRAP_REG_A199_196_PAD_3_MASK)
/*! @} */

/*! @name REG_A203_200 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A203_200_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A203_200_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A203_200_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A203_200_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A203_200_PAD_0_SHIFT)) & VIRT_WRAP_REG_A203_200_PAD_0_MASK)

#define VIRT_WRAP_REG_A203_200_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A203_200_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A203_200_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A203_200_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A203_200_PAD_1_SHIFT)) & VIRT_WRAP_REG_A203_200_PAD_1_MASK)

#define VIRT_WRAP_REG_A203_200_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A203_200_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A203_200_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A203_200_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A203_200_PAD_2_SHIFT)) & VIRT_WRAP_REG_A203_200_PAD_2_MASK)

#define VIRT_WRAP_REG_A203_200_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A203_200_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A203_200_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A203_200_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A203_200_PAD_3_SHIFT)) & VIRT_WRAP_REG_A203_200_PAD_3_MASK)
/*! @} */

/*! @name REG_A207_204 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A207_204_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A207_204_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A207_204_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A207_204_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A207_204_PAD_0_SHIFT)) & VIRT_WRAP_REG_A207_204_PAD_0_MASK)

#define VIRT_WRAP_REG_A207_204_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A207_204_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A207_204_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A207_204_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A207_204_PAD_1_SHIFT)) & VIRT_WRAP_REG_A207_204_PAD_1_MASK)

#define VIRT_WRAP_REG_A207_204_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A207_204_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A207_204_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A207_204_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A207_204_PAD_2_SHIFT)) & VIRT_WRAP_REG_A207_204_PAD_2_MASK)

#define VIRT_WRAP_REG_A207_204_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A207_204_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A207_204_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A207_204_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A207_204_PAD_3_SHIFT)) & VIRT_WRAP_REG_A207_204_PAD_3_MASK)
/*! @} */

/*! @name REG_A211_208 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A211_208_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A211_208_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A211_208_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A211_208_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A211_208_PAD_0_SHIFT)) & VIRT_WRAP_REG_A211_208_PAD_0_MASK)

#define VIRT_WRAP_REG_A211_208_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A211_208_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A211_208_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A211_208_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A211_208_PAD_1_SHIFT)) & VIRT_WRAP_REG_A211_208_PAD_1_MASK)
/*! @} */

/*! @name REG_A215_212 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A215_212_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A215_212_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A215_212_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A215_212_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A215_212_PAD_0_SHIFT)) & VIRT_WRAP_REG_A215_212_PAD_0_MASK)

