zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_A215_212_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A215_212_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A215_212_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A215_212_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A215_212_PAD_1_SHIFT)) & VIRT_WRAP_REG_A215_212_PAD_1_MASK)

#define VIRT_WRAP_REG_A215_212_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A215_212_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A215_212_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A215_212_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A215_212_PAD_2_SHIFT)) & VIRT_WRAP_REG_A215_212_PAD_2_MASK)

#define VIRT_WRAP_REG_A215_212_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A215_212_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A215_212_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A215_212_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A215_212_PAD_3_SHIFT)) & VIRT_WRAP_REG_A215_212_PAD_3_MASK)
/*! @} */

/*! @name REG_A219_216 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A219_216_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A219_216_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A219_216_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A219_216_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A219_216_PAD_0_SHIFT)) & VIRT_WRAP_REG_A219_216_PAD_0_MASK)

#define VIRT_WRAP_REG_A219_216_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A219_216_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A219_216_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A219_216_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A219_216_PAD_1_SHIFT)) & VIRT_WRAP_REG_A219_216_PAD_1_MASK)

#define VIRT_WRAP_REG_A219_216_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A219_216_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A219_216_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A219_216_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A219_216_PAD_2_SHIFT)) & VIRT_WRAP_REG_A219_216_PAD_2_MASK)

#define VIRT_WRAP_REG_A219_216_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A219_216_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A219_216_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A219_216_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A219_216_PAD_3_SHIFT)) & VIRT_WRAP_REG_A219_216_PAD_3_MASK)
/*! @} */

/*! @name REG_A223_220 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A223_220_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A223_220_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A223_220_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A223_220_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A223_220_PAD_2_SHIFT)) & VIRT_WRAP_REG_A223_220_PAD_2_MASK)

#define VIRT_WRAP_REG_A223_220_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A223_220_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A223_220_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A223_220_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A223_220_PAD_3_SHIFT)) & VIRT_WRAP_REG_A223_220_PAD_3_MASK)
/*! @} */

/*! @name REG_A227_224 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A227_224_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A227_224_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A227_224_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A227_224_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A227_224_PAD_0_SHIFT)) & VIRT_WRAP_REG_A227_224_PAD_0_MASK)

#define VIRT_WRAP_REG_A227_224_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A227_224_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A227_224_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A227_224_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A227_224_PAD_1_SHIFT)) & VIRT_WRAP_REG_A227_224_PAD_1_MASK)

#define VIRT_WRAP_REG_A227_224_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A227_224_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A227_224_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A227_224_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A227_224_PAD_2_SHIFT)) & VIRT_WRAP_REG_A227_224_PAD_2_MASK)

#define VIRT_WRAP_REG_A227_224_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A227_224_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A227_224_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A227_224_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A227_224_PAD_3_SHIFT)) & VIRT_WRAP_REG_A227_224_PAD_3_MASK)
/*! @} */

/*! @name REG_A231_228 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A231_228_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A231_228_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A231_228_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A231_228_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A231_228_PAD_0_SHIFT)) & VIRT_WRAP_REG_A231_228_PAD_0_MASK)

#define VIRT_WRAP_REG_A231_228_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A231_228_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A231_228_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A231_228_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A231_228_PAD_3_SHIFT)) & VIRT_WRAP_REG_A231_228_PAD_3_MASK)
/*! @} */

/*! @name REG_A235_232 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A235_232_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A235_232_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A235_232_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A235_232_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A235_232_PAD_0_SHIFT)) & VIRT_WRAP_REG_A235_232_PAD_0_MASK)

#define VIRT_WRAP_REG_A235_232_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A235_232_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A235_232_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A235_232_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A235_232_PAD_1_SHIFT)) & VIRT_WRAP_REG_A235_232_PAD_1_MASK)

#define VIRT_WRAP_REG_A235_232_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A235_232_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A235_232_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A235_232_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A235_232_PAD_2_SHIFT)) & VIRT_WRAP_REG_A235_232_PAD_2_MASK)

#define VIRT_WRAP_REG_A235_232_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A235_232_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A235_232_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A235_232_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A235_232_PAD_3_SHIFT)) & VIRT_WRAP_REG_A235_232_PAD_3_MASK)
/*! @} */

/*! @name REG_A239_236 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A239_236_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A239_236_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A239_236_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A239_236_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A239_236_PAD_0_SHIFT)) & VIRT_WRAP_REG_A239_236_PAD_0_MASK)

