zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_A239_236_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A239_236_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A239_236_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A239_236_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A239_236_PAD_1_SHIFT)) & VIRT_WRAP_REG_A239_236_PAD_1_MASK)

#define VIRT_WRAP_REG_A239_236_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A239_236_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A239_236_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A239_236_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A239_236_PAD_2_SHIFT)) & VIRT_WRAP_REG_A239_236_PAD_2_MASK)

#define VIRT_WRAP_REG_A239_236_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A239_236_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A239_236_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A239_236_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A239_236_PAD_3_SHIFT)) & VIRT_WRAP_REG_A239_236_PAD_3_MASK)
/*! @} */

/*! @name REG_A243_240 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A243_240_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A243_240_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A243_240_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A243_240_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A243_240_PAD_0_SHIFT)) & VIRT_WRAP_REG_A243_240_PAD_0_MASK)

#define VIRT_WRAP_REG_A243_240_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A243_240_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A243_240_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A243_240_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A243_240_PAD_1_SHIFT)) & VIRT_WRAP_REG_A243_240_PAD_1_MASK)

#define VIRT_WRAP_REG_A243_240_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A243_240_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A243_240_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A243_240_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A243_240_PAD_2_SHIFT)) & VIRT_WRAP_REG_A243_240_PAD_2_MASK)

#define VIRT_WRAP_REG_A243_240_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A243_240_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A243_240_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A243_240_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A243_240_PAD_3_SHIFT)) & VIRT_WRAP_REG_A243_240_PAD_3_MASK)
/*! @} */

/*! @name REG_A247_244 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A247_244_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A247_244_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A247_244_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A247_244_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A247_244_PAD_0_SHIFT)) & VIRT_WRAP_REG_A247_244_PAD_0_MASK)

#define VIRT_WRAP_REG_A247_244_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A247_244_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A247_244_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A247_244_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A247_244_PAD_1_SHIFT)) & VIRT_WRAP_REG_A247_244_PAD_1_MASK)

#define VIRT_WRAP_REG_A247_244_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A247_244_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A247_244_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A247_244_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A247_244_PAD_2_SHIFT)) & VIRT_WRAP_REG_A247_244_PAD_2_MASK)

#define VIRT_WRAP_REG_A247_244_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A247_244_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A247_244_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A247_244_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A247_244_PAD_3_SHIFT)) & VIRT_WRAP_REG_A247_244_PAD_3_MASK)
/*! @} */

/*! @name REG_A251_248 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A251_248_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A251_248_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A251_248_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A251_248_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A251_248_PAD_1_SHIFT)) & VIRT_WRAP_REG_A251_248_PAD_1_MASK)

#define VIRT_WRAP_REG_A251_248_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A251_248_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A251_248_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A251_248_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A251_248_PAD_3_SHIFT)) & VIRT_WRAP_REG_A251_248_PAD_3_MASK)
/*! @} */

/*! @name REG_A255_252 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A255_252_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A255_252_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A255_252_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A255_252_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A255_252_PAD_1_SHIFT)) & VIRT_WRAP_REG_A255_252_PAD_1_MASK)

#define VIRT_WRAP_REG_A255_252_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A255_252_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A255_252_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A255_252_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A255_252_PAD_2_SHIFT)) & VIRT_WRAP_REG_A255_252_PAD_2_MASK)
/*! @} */

/*! @name REG_A259_256 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A259_256_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A259_256_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A259_256_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A259_256_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A259_256_PAD_0_SHIFT)) & VIRT_WRAP_REG_A259_256_PAD_0_MASK)

#define VIRT_WRAP_REG_A259_256_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A259_256_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A259_256_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A259_256_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A259_256_PAD_1_SHIFT)) & VIRT_WRAP_REG_A259_256_PAD_1_MASK)

#define VIRT_WRAP_REG_A259_256_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A259_256_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A259_256_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A259_256_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A259_256_PAD_2_SHIFT)) & VIRT_WRAP_REG_A259_256_PAD_2_MASK)

