zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_A319_316_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A319_316_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A319_316_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A319_316_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A319_316_PAD_1_SHIFT)) & VIRT_WRAP_REG_A319_316_PAD_1_MASK)

#define VIRT_WRAP_REG_A319_316_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A319_316_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A319_316_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A319_316_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A319_316_PAD_2_SHIFT)) & VIRT_WRAP_REG_A319_316_PAD_2_MASK)

#define VIRT_WRAP_REG_A319_316_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A319_316_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A319_316_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A319_316_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A319_316_PAD_3_SHIFT)) & VIRT_WRAP_REG_A319_316_PAD_3_MASK)
/*! @} */

/*! @name REG_A323_320 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A323_320_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A323_320_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A323_320_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A323_320_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A323_320_PAD_0_SHIFT)) & VIRT_WRAP_REG_A323_320_PAD_0_MASK)

#define VIRT_WRAP_REG_A323_320_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A323_320_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A323_320_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A323_320_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A323_320_PAD_1_SHIFT)) & VIRT_WRAP_REG_A323_320_PAD_1_MASK)

#define VIRT_WRAP_REG_A323_320_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A323_320_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A323_320_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A323_320_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A323_320_PAD_2_SHIFT)) & VIRT_WRAP_REG_A323_320_PAD_2_MASK)

#define VIRT_WRAP_REG_A323_320_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A323_320_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A323_320_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A323_320_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A323_320_PAD_3_SHIFT)) & VIRT_WRAP_REG_A323_320_PAD_3_MASK)
/*! @} */

/*! @name REG_A327_324 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A327_324_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A327_324_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A327_324_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A327_324_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A327_324_PAD_0_SHIFT)) & VIRT_WRAP_REG_A327_324_PAD_0_MASK)

#define VIRT_WRAP_REG_A327_324_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A327_324_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A327_324_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A327_324_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A327_324_PAD_1_SHIFT)) & VIRT_WRAP_REG_A327_324_PAD_1_MASK)

#define VIRT_WRAP_REG_A327_324_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A327_324_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A327_324_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A327_324_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A327_324_PAD_2_SHIFT)) & VIRT_WRAP_REG_A327_324_PAD_2_MASK)

#define VIRT_WRAP_REG_A327_324_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A327_324_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A327_324_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A327_324_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A327_324_PAD_3_SHIFT)) & VIRT_WRAP_REG_A327_324_PAD_3_MASK)
/*! @} */

/*! @name REG_A331_328 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A331_328_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A331_328_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A331_328_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A331_328_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A331_328_PAD_0_SHIFT)) & VIRT_WRAP_REG_A331_328_PAD_0_MASK)

#define VIRT_WRAP_REG_A331_328_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A331_328_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A331_328_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A331_328_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A331_328_PAD_1_SHIFT)) & VIRT_WRAP_REG_A331_328_PAD_1_MASK)

#define VIRT_WRAP_REG_A331_328_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A331_328_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A331_328_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A331_328_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A331_328_PAD_2_SHIFT)) & VIRT_WRAP_REG_A331_328_PAD_2_MASK)

#define VIRT_WRAP_REG_A331_328_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A331_328_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A331_328_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A331_328_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A331_328_PAD_3_SHIFT)) & VIRT_WRAP_REG_A331_328_PAD_3_MASK)
/*! @} */

/*! @name REG_A335_332 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A335_332_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A335_332_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A335_332_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A335_332_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A335_332_PAD_0_SHIFT)) & VIRT_WRAP_REG_A335_332_PAD_0_MASK)

#define VIRT_WRAP_REG_A335_332_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A335_332_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A335_332_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A335_332_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A335_332_PAD_1_SHIFT)) & VIRT_WRAP_REG_A335_332_PAD_1_MASK)

#define VIRT_WRAP_REG_A335_332_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A335_332_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A335_332_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A335_332_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A335_332_PAD_2_SHIFT)) & VIRT_WRAP_REG_A335_332_PAD_2_MASK)

#define VIRT_WRAP_REG_A335_332_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A335_332_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A335_332_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A335_332_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A335_332_PAD_3_SHIFT)) & VIRT_WRAP_REG_A335_332_PAD_3_MASK)
/*! @} */

