zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
/*! @name REG_A339_336 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A339_336_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A339_336_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A339_336_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A339_336_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A339_336_PAD_0_SHIFT)) & VIRT_WRAP_REG_A339_336_PAD_0_MASK)

#define VIRT_WRAP_REG_A339_336_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A339_336_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A339_336_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A339_336_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A339_336_PAD_1_SHIFT)) & VIRT_WRAP_REG_A339_336_PAD_1_MASK)

#define VIRT_WRAP_REG_A339_336_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A339_336_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A339_336_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A339_336_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A339_336_PAD_2_SHIFT)) & VIRT_WRAP_REG_A339_336_PAD_2_MASK)

#define VIRT_WRAP_REG_A339_336_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A339_336_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A339_336_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A339_336_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A339_336_PAD_3_SHIFT)) & VIRT_WRAP_REG_A339_336_PAD_3_MASK)
/*! @} */

/*! @name REG_A343_340 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A343_340_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A343_340_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A343_340_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A343_340_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A343_340_PAD_0_SHIFT)) & VIRT_WRAP_REG_A343_340_PAD_0_MASK)

#define VIRT_WRAP_REG_A343_340_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A343_340_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A343_340_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A343_340_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A343_340_PAD_1_SHIFT)) & VIRT_WRAP_REG_A343_340_PAD_1_MASK)

#define VIRT_WRAP_REG_A343_340_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A343_340_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A343_340_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A343_340_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A343_340_PAD_2_SHIFT)) & VIRT_WRAP_REG_A343_340_PAD_2_MASK)

#define VIRT_WRAP_REG_A343_340_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A343_340_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A343_340_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A343_340_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A343_340_PAD_3_SHIFT)) & VIRT_WRAP_REG_A343_340_PAD_3_MASK)
/*! @} */

/*! @name REG_A347_344 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A347_344_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A347_344_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A347_344_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A347_344_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A347_344_PAD_0_SHIFT)) & VIRT_WRAP_REG_A347_344_PAD_0_MASK)

#define VIRT_WRAP_REG_A347_344_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A347_344_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A347_344_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A347_344_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A347_344_PAD_1_SHIFT)) & VIRT_WRAP_REG_A347_344_PAD_1_MASK)

#define VIRT_WRAP_REG_A347_344_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A347_344_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A347_344_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A347_344_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A347_344_PAD_2_SHIFT)) & VIRT_WRAP_REG_A347_344_PAD_2_MASK)

#define VIRT_WRAP_REG_A347_344_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A347_344_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A347_344_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A347_344_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A347_344_PAD_3_SHIFT)) & VIRT_WRAP_REG_A347_344_PAD_3_MASK)
/*! @} */

/*! @name REG_A351_348 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A351_348_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A351_348_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A351_348_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A351_348_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A351_348_PAD_0_SHIFT)) & VIRT_WRAP_REG_A351_348_PAD_0_MASK)

#define VIRT_WRAP_REG_A351_348_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A351_348_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A351_348_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A351_348_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A351_348_PAD_1_SHIFT)) & VIRT_WRAP_REG_A351_348_PAD_1_MASK)

#define VIRT_WRAP_REG_A351_348_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A351_348_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A351_348_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A351_348_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A351_348_PAD_2_SHIFT)) & VIRT_WRAP_REG_A351_348_PAD_2_MASK)

#define VIRT_WRAP_REG_A351_348_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A351_348_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A351_348_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A351_348_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A351_348_PAD_3_SHIFT)) & VIRT_WRAP_REG_A351_348_PAD_3_MASK)
/*! @} */

/*! @name REG_A355_352 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_A355_352_PAD_0_MASK        (0xFU)
#define VIRT_WRAP_REG_A355_352_PAD_0_SHIFT       (0U)
#define VIRT_WRAP_REG_A355_352_PAD_0_WIDTH       (4U)
#define VIRT_WRAP_REG_A355_352_PAD_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A355_352_PAD_0_SHIFT)) & VIRT_WRAP_REG_A355_352_PAD_0_MASK)

#define VIRT_WRAP_REG_A355_352_PAD_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_A355_352_PAD_1_SHIFT       (8U)
#define VIRT_WRAP_REG_A355_352_PAD_1_WIDTH       (4U)
#define VIRT_WRAP_REG_A355_352_PAD_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A355_352_PAD_1_SHIFT)) & VIRT_WRAP_REG_A355_352_PAD_1_MASK)

#define VIRT_WRAP_REG_A355_352_PAD_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_A355_352_PAD_2_SHIFT       (16U)
#define VIRT_WRAP_REG_A355_352_PAD_2_WIDTH       (4U)
#define VIRT_WRAP_REG_A355_352_PAD_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A355_352_PAD_2_SHIFT)) & VIRT_WRAP_REG_A355_352_PAD_2_MASK)

#define VIRT_WRAP_REG_A355_352_PAD_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_A355_352_PAD_3_SHIFT       (24U)
#define VIRT_WRAP_REG_A355_352_PAD_3_WIDTH       (4U)
#define VIRT_WRAP_REG_A355_352_PAD_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_A355_352_PAD_3_SHIFT)) & VIRT_WRAP_REG_A355_352_PAD_3_MASK)
/*! @} */

/*! @name REG_A359_356 - Parameter_n Register */
/*! @{ */

