zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_B11_8_INMUX_2_MASK         (0xF0000U)
#define VIRT_WRAP_REG_B11_8_INMUX_2_SHIFT        (16U)
#define VIRT_WRAP_REG_B11_8_INMUX_2_WIDTH        (4U)
#define VIRT_WRAP_REG_B11_8_INMUX_2(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B11_8_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B11_8_INMUX_2_MASK)

#define VIRT_WRAP_REG_B11_8_INMUX_3_MASK         (0xF000000U)
#define VIRT_WRAP_REG_B11_8_INMUX_3_SHIFT        (24U)
#define VIRT_WRAP_REG_B11_8_INMUX_3_WIDTH        (4U)
#define VIRT_WRAP_REG_B11_8_INMUX_3(x)           (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B11_8_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B11_8_INMUX_3_MASK)
/*! @} */

/*! @name REG_B15_12 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B15_12_INMUX_0_MASK        (0xFU)
#define VIRT_WRAP_REG_B15_12_INMUX_0_SHIFT       (0U)
#define VIRT_WRAP_REG_B15_12_INMUX_0_WIDTH       (4U)
#define VIRT_WRAP_REG_B15_12_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B15_12_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B15_12_INMUX_0_MASK)

#define VIRT_WRAP_REG_B15_12_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B15_12_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B15_12_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B15_12_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B15_12_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B15_12_INMUX_1_MASK)

#define VIRT_WRAP_REG_B15_12_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B15_12_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B15_12_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B15_12_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B15_12_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B15_12_INMUX_2_MASK)

#define VIRT_WRAP_REG_B15_12_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B15_12_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B15_12_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B15_12_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B15_12_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B15_12_INMUX_3_MASK)
/*! @} */

/*! @name REG_B19_16 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B19_16_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B19_16_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B19_16_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B19_16_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B19_16_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B19_16_INMUX_3_MASK)
/*! @} */

/*! @name REG_B23_20 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B23_20_INMUX_0_MASK        (0xFU)
#define VIRT_WRAP_REG_B23_20_INMUX_0_SHIFT       (0U)
#define VIRT_WRAP_REG_B23_20_INMUX_0_WIDTH       (4U)
#define VIRT_WRAP_REG_B23_20_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B23_20_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B23_20_INMUX_0_MASK)

#define VIRT_WRAP_REG_B23_20_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B23_20_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B23_20_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B23_20_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B23_20_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B23_20_INMUX_1_MASK)

#define VIRT_WRAP_REG_B23_20_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B23_20_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B23_20_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B23_20_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B23_20_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B23_20_INMUX_2_MASK)

#define VIRT_WRAP_REG_B23_20_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B23_20_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B23_20_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B23_20_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B23_20_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B23_20_INMUX_3_MASK)
/*! @} */

/*! @name REG_B27_24 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B27_24_INMUX_0_MASK        (0xFU)
#define VIRT_WRAP_REG_B27_24_INMUX_0_SHIFT       (0U)
#define VIRT_WRAP_REG_B27_24_INMUX_0_WIDTH       (4U)
#define VIRT_WRAP_REG_B27_24_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B27_24_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B27_24_INMUX_0_MASK)

#define VIRT_WRAP_REG_B27_24_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B27_24_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B27_24_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B27_24_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B27_24_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B27_24_INMUX_1_MASK)
/*! @} */

/*! @name REG_B31_28 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B31_28_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B31_28_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B31_28_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B31_28_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B31_28_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B31_28_INMUX_1_MASK)

#define VIRT_WRAP_REG_B31_28_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B31_28_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B31_28_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B31_28_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B31_28_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B31_28_INMUX_2_MASK)

#define VIRT_WRAP_REG_B31_28_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B31_28_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B31_28_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B31_28_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B31_28_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B31_28_INMUX_3_MASK)
/*! @} */

/*! @name REG_B35_32 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B35_32_INMUX_0_MASK        (0xFU)
#define VIRT_WRAP_REG_B35_32_INMUX_0_SHIFT       (0U)
#define VIRT_WRAP_REG_B35_32_INMUX_0_WIDTH       (4U)
#define VIRT_WRAP_REG_B35_32_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B35_32_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B35_32_INMUX_0_MASK)

#define VIRT_WRAP_REG_B35_32_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B35_32_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B35_32_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B35_32_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B35_32_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B35_32_INMUX_1_MASK)

#define VIRT_WRAP_REG_B35_32_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B35_32_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B35_32_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B35_32_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B35_32_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B35_32_INMUX_3_MASK)
/*! @} */

/*! @name REG_B39_36 - Parameter_n Register */
/*! @{ */

