zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_B59_56_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B59_56_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B59_56_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B59_56_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B59_56_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B59_56_INMUX_1_MASK)

#define VIRT_WRAP_REG_B59_56_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B59_56_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B59_56_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B59_56_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B59_56_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B59_56_INMUX_2_MASK)

#define VIRT_WRAP_REG_B59_56_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B59_56_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B59_56_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B59_56_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B59_56_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B59_56_INMUX_3_MASK)
/*! @} */

/*! @name REG_B63_60 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B63_60_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B63_60_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B63_60_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B63_60_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B63_60_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B63_60_INMUX_1_MASK)

#define VIRT_WRAP_REG_B63_60_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B63_60_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B63_60_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B63_60_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B63_60_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B63_60_INMUX_2_MASK)

#define VIRT_WRAP_REG_B63_60_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B63_60_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B63_60_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B63_60_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B63_60_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B63_60_INMUX_3_MASK)
/*! @} */

/*! @name REG_B67_64 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B67_64_INMUX_0_MASK        (0xFU)
#define VIRT_WRAP_REG_B67_64_INMUX_0_SHIFT       (0U)
#define VIRT_WRAP_REG_B67_64_INMUX_0_WIDTH       (4U)
#define VIRT_WRAP_REG_B67_64_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B67_64_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B67_64_INMUX_0_MASK)

#define VIRT_WRAP_REG_B67_64_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B67_64_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B67_64_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B67_64_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B67_64_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B67_64_INMUX_1_MASK)

#define VIRT_WRAP_REG_B67_64_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B67_64_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B67_64_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B67_64_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B67_64_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B67_64_INMUX_2_MASK)

#define VIRT_WRAP_REG_B67_64_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B67_64_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B67_64_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B67_64_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B67_64_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B67_64_INMUX_3_MASK)
/*! @} */

/*! @name REG_B71_68 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B71_68_INMUX_0_MASK        (0xFU)
#define VIRT_WRAP_REG_B71_68_INMUX_0_SHIFT       (0U)
#define VIRT_WRAP_REG_B71_68_INMUX_0_WIDTH       (4U)
#define VIRT_WRAP_REG_B71_68_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B71_68_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B71_68_INMUX_0_MASK)

#define VIRT_WRAP_REG_B71_68_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B71_68_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B71_68_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B71_68_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B71_68_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B71_68_INMUX_1_MASK)

#define VIRT_WRAP_REG_B71_68_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B71_68_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B71_68_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B71_68_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B71_68_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B71_68_INMUX_2_MASK)

#define VIRT_WRAP_REG_B71_68_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B71_68_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B71_68_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B71_68_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B71_68_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B71_68_INMUX_3_MASK)
/*! @} */

/*! @name REG_B75_72 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B75_72_INMUX_0_MASK        (0xFU)
#define VIRT_WRAP_REG_B75_72_INMUX_0_SHIFT       (0U)
#define VIRT_WRAP_REG_B75_72_INMUX_0_WIDTH       (4U)
#define VIRT_WRAP_REG_B75_72_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B75_72_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B75_72_INMUX_0_MASK)

#define VIRT_WRAP_REG_B75_72_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B75_72_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B75_72_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B75_72_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B75_72_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B75_72_INMUX_1_MASK)

#define VIRT_WRAP_REG_B75_72_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B75_72_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B75_72_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B75_72_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B75_72_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B75_72_INMUX_2_MASK)

#define VIRT_WRAP_REG_B75_72_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B75_72_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B75_72_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B75_72_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B75_72_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B75_72_INMUX_3_MASK)
/*! @} */

/*! @name REG_B79_76 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B79_76_INMUX_0_MASK        (0xFU)
#define VIRT_WRAP_REG_B79_76_INMUX_0_SHIFT       (0U)
#define VIRT_WRAP_REG_B79_76_INMUX_0_WIDTH       (4U)
#define VIRT_WRAP_REG_B79_76_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B79_76_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B79_76_INMUX_0_MASK)

#define VIRT_WRAP_REG_B79_76_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B79_76_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B79_76_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B79_76_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B79_76_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B79_76_INMUX_1_MASK)

#define VIRT_WRAP_REG_B79_76_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B79_76_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B79_76_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B79_76_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B79_76_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B79_76_INMUX_2_MASK)

#define VIRT_WRAP_REG_B79_76_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B79_76_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B79_76_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B79_76_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B79_76_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B79_76_INMUX_3_MASK)
/*! @} */

/*! @name REG_B83_80 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B83_80_INMUX_0_MASK        (0xFU)
#define VIRT_WRAP_REG_B83_80_INMUX_0_SHIFT       (0U)
#define VIRT_WRAP_REG_B83_80_INMUX_0_WIDTH       (4U)
#define VIRT_WRAP_REG_B83_80_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B83_80_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B83_80_INMUX_0_MASK)

#define VIRT_WRAP_REG_B83_80_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B83_80_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B83_80_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B83_80_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B83_80_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B83_80_INMUX_1_MASK)

#define VIRT_WRAP_REG_B83_80_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B83_80_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B83_80_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B83_80_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B83_80_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B83_80_INMUX_2_MASK)

#define VIRT_WRAP_REG_B83_80_INMUX_3_MASK        (0xF000000U)
#define VIRT_WRAP_REG_B83_80_INMUX_3_SHIFT       (24U)
#define VIRT_WRAP_REG_B83_80_INMUX_3_WIDTH       (4U)
#define VIRT_WRAP_REG_B83_80_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B83_80_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B83_80_INMUX_3_MASK)
/*! @} */

/*! @name REG_B87_84 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B87_84_INMUX_0_MASK        (0xFU)
#define VIRT_WRAP_REG_B87_84_INMUX_0_SHIFT       (0U)
#define VIRT_WRAP_REG_B87_84_INMUX_0_WIDTH       (4U)
#define VIRT_WRAP_REG_B87_84_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B87_84_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B87_84_INMUX_0_MASK)

#define VIRT_WRAP_REG_B87_84_INMUX_1_MASK        (0xF00U)
#define VIRT_WRAP_REG_B87_84_INMUX_1_SHIFT       (8U)
#define VIRT_WRAP_REG_B87_84_INMUX_1_WIDTH       (4U)
#define VIRT_WRAP_REG_B87_84_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B87_84_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B87_84_INMUX_1_MASK)

#define VIRT_WRAP_REG_B87_84_INMUX_2_MASK        (0xF0000U)
#define VIRT_WRAP_REG_B87_84_INMUX_2_SHIFT       (16U)
#define VIRT_WRAP_REG_B87_84_INMUX_2_WIDTH       (4U)
#define VIRT_WRAP_REG_B87_84_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B87_84_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B87_84_INMUX_2_MASK)

