zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_B107_104_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B107_104_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B107_104_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B107_104_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B107_104_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B107_104_INMUX_1_MASK)

#define VIRT_WRAP_REG_B107_104_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B107_104_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B107_104_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B107_104_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B107_104_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B107_104_INMUX_2_MASK)

#define VIRT_WRAP_REG_B107_104_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B107_104_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B107_104_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B107_104_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B107_104_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B107_104_INMUX_3_MASK)
/*! @} */

/*! @name REG_B111_108 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B111_108_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B111_108_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B111_108_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B111_108_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B111_108_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B111_108_INMUX_0_MASK)

#define VIRT_WRAP_REG_B111_108_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B111_108_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B111_108_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B111_108_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B111_108_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B111_108_INMUX_1_MASK)

#define VIRT_WRAP_REG_B111_108_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B111_108_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B111_108_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B111_108_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B111_108_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B111_108_INMUX_2_MASK)

#define VIRT_WRAP_REG_B111_108_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B111_108_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B111_108_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B111_108_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B111_108_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B111_108_INMUX_3_MASK)
/*! @} */

/*! @name REG_B115_112 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B115_112_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B115_112_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B115_112_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B115_112_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B115_112_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B115_112_INMUX_0_MASK)

#define VIRT_WRAP_REG_B115_112_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B115_112_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B115_112_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B115_112_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B115_112_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B115_112_INMUX_1_MASK)

#define VIRT_WRAP_REG_B115_112_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B115_112_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B115_112_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B115_112_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B115_112_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B115_112_INMUX_2_MASK)

#define VIRT_WRAP_REG_B115_112_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B115_112_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B115_112_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B115_112_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B115_112_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B115_112_INMUX_3_MASK)
/*! @} */

/*! @name REG_B119_116 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B119_116_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B119_116_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B119_116_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B119_116_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B119_116_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B119_116_INMUX_0_MASK)

#define VIRT_WRAP_REG_B119_116_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B119_116_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B119_116_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B119_116_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B119_116_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B119_116_INMUX_1_MASK)

#define VIRT_WRAP_REG_B119_116_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B119_116_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B119_116_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B119_116_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B119_116_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B119_116_INMUX_2_MASK)

#define VIRT_WRAP_REG_B119_116_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B119_116_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B119_116_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B119_116_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B119_116_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B119_116_INMUX_3_MASK)
/*! @} */

/*! @name REG_B123_120 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B123_120_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B123_120_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B123_120_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B123_120_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B123_120_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B123_120_INMUX_0_MASK)

#define VIRT_WRAP_REG_B123_120_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B123_120_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B123_120_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B123_120_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B123_120_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B123_120_INMUX_1_MASK)

#define VIRT_WRAP_REG_B123_120_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B123_120_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B123_120_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B123_120_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B123_120_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B123_120_INMUX_2_MASK)

#define VIRT_WRAP_REG_B123_120_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B123_120_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B123_120_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B123_120_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B123_120_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B123_120_INMUX_3_MASK)
/*! @} */

/*! @name REG_B127_124 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B127_124_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B127_124_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B127_124_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B127_124_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B127_124_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B127_124_INMUX_0_MASK)

#define VIRT_WRAP_REG_B127_124_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B127_124_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B127_124_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B127_124_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B127_124_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B127_124_INMUX_1_MASK)

#define VIRT_WRAP_REG_B127_124_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B127_124_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B127_124_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B127_124_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B127_124_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B127_124_INMUX_2_MASK)

