zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_B127_124_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B127_124_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B127_124_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B127_124_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B127_124_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B127_124_INMUX_3_MASK)
/*! @} */

/*! @name REG_B131_128 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B131_128_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B131_128_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B131_128_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B131_128_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B131_128_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B131_128_INMUX_0_MASK)

#define VIRT_WRAP_REG_B131_128_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B131_128_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B131_128_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B131_128_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B131_128_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B131_128_INMUX_1_MASK)

#define VIRT_WRAP_REG_B131_128_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B131_128_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B131_128_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B131_128_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B131_128_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B131_128_INMUX_2_MASK)

#define VIRT_WRAP_REG_B131_128_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B131_128_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B131_128_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B131_128_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B131_128_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B131_128_INMUX_3_MASK)
/*! @} */

/*! @name REG_B135_132 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B135_132_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B135_132_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B135_132_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B135_132_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B135_132_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B135_132_INMUX_0_MASK)

#define VIRT_WRAP_REG_B135_132_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B135_132_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B135_132_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B135_132_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B135_132_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B135_132_INMUX_1_MASK)

#define VIRT_WRAP_REG_B135_132_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B135_132_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B135_132_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B135_132_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B135_132_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B135_132_INMUX_2_MASK)

#define VIRT_WRAP_REG_B135_132_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B135_132_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B135_132_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B135_132_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B135_132_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B135_132_INMUX_3_MASK)
/*! @} */

/*! @name REG_B139_136 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B139_136_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B139_136_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B139_136_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B139_136_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B139_136_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B139_136_INMUX_0_MASK)

#define VIRT_WRAP_REG_B139_136_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B139_136_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B139_136_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B139_136_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B139_136_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B139_136_INMUX_1_MASK)

#define VIRT_WRAP_REG_B139_136_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B139_136_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B139_136_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B139_136_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B139_136_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B139_136_INMUX_2_MASK)

#define VIRT_WRAP_REG_B139_136_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B139_136_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B139_136_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B139_136_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B139_136_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B139_136_INMUX_3_MASK)
/*! @} */

/*! @name REG_B143_140 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B143_140_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B143_140_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B143_140_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B143_140_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B143_140_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B143_140_INMUX_0_MASK)

#define VIRT_WRAP_REG_B143_140_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B143_140_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B143_140_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B143_140_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B143_140_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B143_140_INMUX_1_MASK)

#define VIRT_WRAP_REG_B143_140_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B143_140_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B143_140_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B143_140_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B143_140_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B143_140_INMUX_2_MASK)

#define VIRT_WRAP_REG_B143_140_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B143_140_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B143_140_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B143_140_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B143_140_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B143_140_INMUX_3_MASK)
/*! @} */

/*! @name REG_B147_144 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B147_144_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B147_144_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B147_144_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B147_144_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B147_144_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B147_144_INMUX_0_MASK)

#define VIRT_WRAP_REG_B147_144_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B147_144_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B147_144_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B147_144_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B147_144_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B147_144_INMUX_1_MASK)

#define VIRT_WRAP_REG_B147_144_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B147_144_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B147_144_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B147_144_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B147_144_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B147_144_INMUX_2_MASK)

#define VIRT_WRAP_REG_B147_144_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B147_144_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B147_144_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B147_144_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B147_144_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B147_144_INMUX_3_MASK)
/*! @} */

/*! @name REG_B151_148 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B151_148_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B151_148_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B151_148_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B151_148_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B151_148_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B151_148_INMUX_0_MASK)

#define VIRT_WRAP_REG_B151_148_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B151_148_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B151_148_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B151_148_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B151_148_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B151_148_INMUX_1_MASK)

#define VIRT_WRAP_REG_B151_148_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B151_148_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B151_148_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B151_148_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B151_148_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B151_148_INMUX_2_MASK)

#define VIRT_WRAP_REG_B151_148_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B151_148_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B151_148_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B151_148_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B151_148_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B151_148_INMUX_3_MASK)
/*! @} */

