zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_B171_168_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B171_168_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B171_168_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B171_168_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B171_168_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B171_168_INMUX_2_MASK)

#define VIRT_WRAP_REG_B171_168_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B171_168_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B171_168_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B171_168_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B171_168_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B171_168_INMUX_3_MASK)
/*! @} */

/*! @name REG_B175_172 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B175_172_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B175_172_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B175_172_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B175_172_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B175_172_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B175_172_INMUX_0_MASK)

#define VIRT_WRAP_REG_B175_172_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B175_172_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B175_172_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B175_172_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B175_172_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B175_172_INMUX_1_MASK)

#define VIRT_WRAP_REG_B175_172_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B175_172_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B175_172_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B175_172_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B175_172_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B175_172_INMUX_2_MASK)

#define VIRT_WRAP_REG_B175_172_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B175_172_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B175_172_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B175_172_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B175_172_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B175_172_INMUX_3_MASK)
/*! @} */

/*! @name REG_B179_176 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B179_176_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B179_176_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B179_176_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B179_176_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B179_176_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B179_176_INMUX_0_MASK)

#define VIRT_WRAP_REG_B179_176_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B179_176_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B179_176_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B179_176_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B179_176_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B179_176_INMUX_1_MASK)

#define VIRT_WRAP_REG_B179_176_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B179_176_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B179_176_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B179_176_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B179_176_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B179_176_INMUX_2_MASK)

#define VIRT_WRAP_REG_B179_176_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B179_176_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B179_176_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B179_176_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B179_176_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B179_176_INMUX_3_MASK)
/*! @} */

/*! @name REG_B183_180 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B183_180_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B183_180_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B183_180_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B183_180_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B183_180_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B183_180_INMUX_0_MASK)

#define VIRT_WRAP_REG_B183_180_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B183_180_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B183_180_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B183_180_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B183_180_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B183_180_INMUX_1_MASK)

#define VIRT_WRAP_REG_B183_180_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B183_180_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B183_180_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B183_180_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B183_180_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B183_180_INMUX_2_MASK)

#define VIRT_WRAP_REG_B183_180_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B183_180_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B183_180_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B183_180_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B183_180_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B183_180_INMUX_3_MASK)
/*! @} */

/*! @name REG_B187_184 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B187_184_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B187_184_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B187_184_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B187_184_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B187_184_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B187_184_INMUX_0_MASK)

#define VIRT_WRAP_REG_B187_184_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B187_184_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B187_184_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B187_184_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B187_184_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B187_184_INMUX_1_MASK)

#define VIRT_WRAP_REG_B187_184_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B187_184_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B187_184_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B187_184_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B187_184_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B187_184_INMUX_2_MASK)

#define VIRT_WRAP_REG_B187_184_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B187_184_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B187_184_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B187_184_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B187_184_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B187_184_INMUX_3_MASK)
/*! @} */

/*! @name REG_B191_188 - Parameter_n Register */
/*! @{ */

