zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_B207_204_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B207_204_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B207_204_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B207_204_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B207_204_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B207_204_INMUX_3_MASK)
/*! @} */

/*! @name REG_B211_208 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B211_208_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B211_208_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B211_208_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B211_208_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B211_208_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B211_208_INMUX_0_MASK)

#define VIRT_WRAP_REG_B211_208_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B211_208_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B211_208_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B211_208_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B211_208_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B211_208_INMUX_1_MASK)

#define VIRT_WRAP_REG_B211_208_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B211_208_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B211_208_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B211_208_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B211_208_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B211_208_INMUX_2_MASK)

#define VIRT_WRAP_REG_B211_208_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B211_208_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B211_208_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B211_208_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B211_208_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B211_208_INMUX_3_MASK)
/*! @} */

/*! @name REG_B215_212 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B215_212_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B215_212_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B215_212_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B215_212_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B215_212_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B215_212_INMUX_0_MASK)

#define VIRT_WRAP_REG_B215_212_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B215_212_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B215_212_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B215_212_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B215_212_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B215_212_INMUX_1_MASK)

#define VIRT_WRAP_REG_B215_212_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B215_212_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B215_212_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B215_212_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B215_212_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B215_212_INMUX_2_MASK)

#define VIRT_WRAP_REG_B215_212_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B215_212_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B215_212_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B215_212_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B215_212_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B215_212_INMUX_3_MASK)
/*! @} */

/*! @name REG_B219_216 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B219_216_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B219_216_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B219_216_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B219_216_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B219_216_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B219_216_INMUX_1_MASK)

#define VIRT_WRAP_REG_B219_216_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B219_216_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B219_216_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B219_216_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B219_216_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B219_216_INMUX_3_MASK)
/*! @} */

/*! @name REG_B223_220 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B223_220_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B223_220_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B223_220_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B223_220_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B223_220_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B223_220_INMUX_0_MASK)

#define VIRT_WRAP_REG_B223_220_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B223_220_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B223_220_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B223_220_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B223_220_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B223_220_INMUX_1_MASK)

#define VIRT_WRAP_REG_B223_220_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B223_220_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B223_220_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B223_220_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B223_220_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B223_220_INMUX_2_MASK)

#define VIRT_WRAP_REG_B223_220_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B223_220_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B223_220_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B223_220_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B223_220_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B223_220_INMUX_3_MASK)
/*! @} */

/*! @name REG_B227_224 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B227_224_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B227_224_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B227_224_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B227_224_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B227_224_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B227_224_INMUX_0_MASK)

#define VIRT_WRAP_REG_B227_224_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B227_224_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B227_224_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B227_224_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B227_224_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B227_224_INMUX_1_MASK)

#define VIRT_WRAP_REG_B227_224_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B227_224_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B227_224_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B227_224_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B227_224_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B227_224_INMUX_2_MASK)

#define VIRT_WRAP_REG_B227_224_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B227_224_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B227_224_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B227_224_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B227_224_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B227_224_INMUX_3_MASK)
/*! @} */

/*! @name REG_B231_228 - Parameter_n Register */
/*! @{ */

