zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VIRT_WRAP.h
#define VIRT_WRAP_REG_B231_228_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B231_228_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B231_228_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B231_228_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B231_228_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B231_228_INMUX_3_MASK)
/*! @} */

/*! @name REG_B235_232 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B235_232_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B235_232_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B235_232_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B235_232_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B235_232_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B235_232_INMUX_0_MASK)

#define VIRT_WRAP_REG_B235_232_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B235_232_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B235_232_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B235_232_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B235_232_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B235_232_INMUX_3_MASK)
/*! @} */

/*! @name REG_B239_236 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B239_236_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B239_236_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B239_236_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B239_236_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B239_236_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B239_236_INMUX_0_MASK)

#define VIRT_WRAP_REG_B239_236_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B239_236_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B239_236_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B239_236_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B239_236_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B239_236_INMUX_1_MASK)

#define VIRT_WRAP_REG_B239_236_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B239_236_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B239_236_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B239_236_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B239_236_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B239_236_INMUX_2_MASK)

#define VIRT_WRAP_REG_B239_236_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B239_236_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B239_236_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B239_236_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B239_236_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B239_236_INMUX_3_MASK)
/*! @} */

/*! @name REG_B243_240 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B243_240_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B243_240_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B243_240_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B243_240_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B243_240_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B243_240_INMUX_0_MASK)

#define VIRT_WRAP_REG_B243_240_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B243_240_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B243_240_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B243_240_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B243_240_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B243_240_INMUX_1_MASK)

#define VIRT_WRAP_REG_B243_240_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B243_240_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B243_240_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B243_240_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B243_240_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B243_240_INMUX_2_MASK)

#define VIRT_WRAP_REG_B243_240_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B243_240_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B243_240_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B243_240_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B243_240_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B243_240_INMUX_3_MASK)
/*! @} */

/*! @name REG_B247_244 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B247_244_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B247_244_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B247_244_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B247_244_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B247_244_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B247_244_INMUX_0_MASK)

#define VIRT_WRAP_REG_B247_244_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B247_244_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B247_244_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B247_244_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B247_244_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B247_244_INMUX_1_MASK)

#define VIRT_WRAP_REG_B247_244_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B247_244_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B247_244_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B247_244_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B247_244_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B247_244_INMUX_2_MASK)

#define VIRT_WRAP_REG_B247_244_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B247_244_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B247_244_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B247_244_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B247_244_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B247_244_INMUX_3_MASK)
/*! @} */

/*! @name REG_B251_248 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B251_248_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B251_248_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B251_248_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B251_248_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B251_248_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B251_248_INMUX_0_MASK)

#define VIRT_WRAP_REG_B251_248_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B251_248_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B251_248_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B251_248_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B251_248_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B251_248_INMUX_1_MASK)

#define VIRT_WRAP_REG_B251_248_INMUX_2_MASK      (0xF0000U)
#define VIRT_WRAP_REG_B251_248_INMUX_2_SHIFT     (16U)
#define VIRT_WRAP_REG_B251_248_INMUX_2_WIDTH     (4U)
#define VIRT_WRAP_REG_B251_248_INMUX_2(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B251_248_INMUX_2_SHIFT)) & VIRT_WRAP_REG_B251_248_INMUX_2_MASK)

#define VIRT_WRAP_REG_B251_248_INMUX_3_MASK      (0xF000000U)
#define VIRT_WRAP_REG_B251_248_INMUX_3_SHIFT     (24U)
#define VIRT_WRAP_REG_B251_248_INMUX_3_WIDTH     (4U)
#define VIRT_WRAP_REG_B251_248_INMUX_3(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B251_248_INMUX_3_SHIFT)) & VIRT_WRAP_REG_B251_248_INMUX_3_MASK)
/*! @} */

/*! @name REG_B255_252 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_B255_252_INMUX_0_MASK      (0xFU)
#define VIRT_WRAP_REG_B255_252_INMUX_0_SHIFT     (0U)
#define VIRT_WRAP_REG_B255_252_INMUX_0_WIDTH     (4U)
#define VIRT_WRAP_REG_B255_252_INMUX_0(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B255_252_INMUX_0_SHIFT)) & VIRT_WRAP_REG_B255_252_INMUX_0_MASK)

#define VIRT_WRAP_REG_B255_252_INMUX_1_MASK      (0xF00U)
#define VIRT_WRAP_REG_B255_252_INMUX_1_SHIFT     (8U)
#define VIRT_WRAP_REG_B255_252_INMUX_1_WIDTH     (4U)
#define VIRT_WRAP_REG_B255_252_INMUX_1(x)        (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_B255_252_INMUX_1_SHIFT)) & VIRT_WRAP_REG_B255_252_INMUX_1_MASK)
/*! @} */

/*! @name REG_C - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_C_INTC_CTRL_MASK           (0xFU)
#define VIRT_WRAP_REG_C_INTC_CTRL_SHIFT          (0U)
#define VIRT_WRAP_REG_C_INTC_CTRL_WIDTH          (4U)
#define VIRT_WRAP_REG_C_INTC_CTRL(x)             (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_C_INTC_CTRL_SHIFT)) & VIRT_WRAP_REG_C_INTC_CTRL_MASK)
/*! @} */

/*! @name REG_D - Parameter_n Register */
/*! @{ */

#define VIRT_WRAP_REG_D_REG_GCR_MASK             (0xFU)
#define VIRT_WRAP_REG_D_REG_GCR_SHIFT            (0U)
#define VIRT_WRAP_REG_D_REG_GCR_WIDTH            (4U)
#define VIRT_WRAP_REG_D_REG_GCR(x)               (((uint32_t)(((uint32_t)(x)) << VIRT_WRAP_REG_D_REG_GCR_SHIFT)) & VIRT_WRAP_REG_D_REG_GCR_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group VIRT_WRAP_Register_Masks */

/*!
 * @}
 */ /* end of group VIRT_WRAP_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_VIRT_WRAP_H_) */
